import {QuizId, QuizSchema} from 'quiz-wizard-schema'

export const initialData: Record<QuizId, QuizSchema> = {
  '6ee6f368-7fda-4726-a04b-1a6bde1230e4': {
    'id': '6ee6f368-7fda-4726-a04b-1a6bde1230e4',
    'name': 'Біологія 11 клас',
    'description': 'Тест з біології для учнів 11 класу.\nРозрахований час виконання 30 хвилин. ',
    'questionsOrder': ['f86b6214-c4d9-4404-a5d9-6e2443cb321f', 'eaad5500-fd39-4bb1-b1a4-6239380d0a09', '0b91a636-2251-453d-ae01-e9391c445823', '1bd19b56-2f63-49fa-bc4e-ea784fd6f980', 'ccdd65f4-7f4f-467d-97b7-1659c6504b54', '6852550a-11a4-48d1-8135-abe9a3570e74', 'e043b962-8a13-4709-91c4-00d3d20fde99', '9d5d2cd6-7b92-4658-b2c4-7a4463453257', '45a37f9a-84fd-416f-89f6-19b4d05fab29', '0389d176-6cd3-4c10-8a4c-853ad789ebd4', 'b0e22604-1b6b-4d48-81a6-b2c5954a7f4a', 'b4004386-d8cb-4449-8332-42ab6a774e36', '1b19a1bc-d43d-49b1-a5c6-d2d33e17a8ed', 'a9d72410-06ec-4c37-9a12-c9ee0c0b3301', 'db48786b-1e42-4b51-80f2-42143cd142ea'],
    'questions': {
      'f86b6214-c4d9-4404-a5d9-6e2443cb321f': {
        'id': 'f86b6214-c4d9-4404-a5d9-6e2443cb321f',
        'text': 'Яка наука досліджує вимерлі організми?',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'палеонтологія',
            'correct': true
          },
          'B': {
            'text': 'морфологія'
          },
          'C': {
            'text': 'еволюційне вчення'
          },
          'D': {
            'text': 'археологія'
          }
        }
      },
      'eaad5500-fd39-4bb1-b1a4-6239380d0a09': {
        'id': 'eaad5500-fd39-4bb1-b1a4-6239380d0a09',
        'text': 'Яка група ліпідів формує основу клітинних мембран?',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'нейтральні жири'
          },
          'B': {
            'text': 'воски'
          },
          'C': {
            'text': 'фосфоліпіди',
            'correct': true
          },
          'D': {
            'text': 'каротиноїди'
          }
        }
      },
      '0b91a636-2251-453d-ae01-e9391c445823': {
        'id': '0b91a636-2251-453d-ae01-e9391c445823',
        'text': 'Рослинна клітина, на відміну від тваринної, має',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'вакуолю з клітинним соком.',
            'correct': true
          },
          'B': {
            'text': 'комплекс Гольджі.'
          },
          'C': {
            'text': 'ендоплазматичну сітку.'
          },
          'D': {
            'text': 'мітохондрії.'
          }
        }
      },
      '1bd19b56-2f63-49fa-bc4e-ea784fd6f980': {
        'id': '1bd19b56-2f63-49fa-bc4e-ea784fd6f980',
        'text': 'Зерниста ендоплазматична сітка відрізняється від незернистої наявністю',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'рибосом.',
            'correct': true
          },
          'B': {
            'text': 'лізосом.'
          },
          'C': {
            'text': 'центросом.'
          },
          'D': {
            'text': 'пероксисом.'
          }
        }
      },
      'ccdd65f4-7f4f-467d-97b7-1659c6504b54': {
        'id': 'ccdd65f4-7f4f-467d-97b7-1659c6504b54',
        'text': 'Мітохондрії називають енергетичними станціями клітини. Така назва органел пов’язана з їхньою функцією',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'синтезу білків.'
          },
          'B': {
            'text': 'синтезу АТФ.',
            'correct': true
          },
          'C': {
            'text': 'транспорту газів, зокрема кисню.'
          },
          'D': {
            'text': 'внутрішньоклітинного травлення.'
          }
        }
      },
      '6852550a-11a4-48d1-8135-abe9a3570e74': {
        'id': '6852550a-11a4-48d1-8135-abe9a3570e74',
        'text': 'Під час досліду з одноклітинною водорістю ацетабулярією (див. рисунок) у водорості Х видалили верхню та середню частини, у водорості Y — верхню та нижню частини. До нижньої частини водорості Х пересадили середню частину водорості Y, у результаті чого штучно створений організм набув вигляду водорості Х. Укажіть правильний висновок з цього експерименту.',
        'cost': 3,
        'answers': {
          'A': {
            'text': 'мітохондрії відповідають за утворення енергії в клітині'
          },
          'B': {
            'text': 'ядро відповідає за збереження спадкової інформації',
            'correct': true
          },
          'C': {
            'text': 'хлоропласти здійснюють процес фотосинтезу'
          },
          'D': {
            'text': 'клітинні мембрани мають властивість відновлюватися'
          }
        },
        'picture': 'http://localhost:4000/static/question-picture/26cdbe8d2bb89d8515d77bec8aa9e92c.jpg'
      },
      'e043b962-8a13-4709-91c4-00d3d20fde99': {
        'id': 'e043b962-8a13-4709-91c4-00d3d20fde99',
        'text': 'На рисунку зображено хромосомний набір',
        'cost': 3,
        'answers': {
          'A': {
            'text': 'здорової жінки.'
          },
          'B': {
            'text': 'здорового чоловіка.',
            'correct': true
          },
          'C': {
            'text': 'жінки, хворої на синдром Дауна.'
          },
          'D': {
            'text': 'чоловіка, хворого на синдром Дауна.'
          }
        },
        'picture': 'http://localhost:4000/static/question-picture/ff3554248fbea9a587d8e4366bee11c9.jpg'
      },
      '9d5d2cd6-7b92-4658-b2c4-7a4463453257': {
        'id': '9d5d2cd6-7b92-4658-b2c4-7a4463453257',
        'text': 'Яку частину квітки позначено на рисунку буквою X?',
        'cost': 3,
        'answers': {
          'A': {
            'text': 'чашолисток'
          },
          'B': {
            'text': 'тичинку'
          },
          'C': {
            'text': 'пелюстку'
          },
          'D': {
            'text': 'маточку',
            'correct': true
          }
        },
        'picture': 'http://localhost:4000/static/question-picture/6e69890442ccade0ce46588b99aebb1c.jpg'
      },
      '45a37f9a-84fd-416f-89f6-19b4d05fab29': {
        'id': '45a37f9a-84fd-416f-89f6-19b4d05fab29',
        'text': 'Яку тканину зображено на рисунку?',
        'cost': 3,
        'answers': {
          'A': {
            'text': 'нервову'
          },
          'B': {
            'text': 'епітеліальну',
            'correct': true
          },
          'C': {
            'text': 'сполучну'
          },
          'D': {
            'text': 'м’язову'
          }
        },
        'picture': 'http://localhost:4000/static/question-picture/6d451e878a710609e2dd6f48fb0d8527.jpg'
      },
      '0389d176-6cd3-4c10-8a4c-853ad789ebd4': {
        'id': '0389d176-6cd3-4c10-8a4c-853ad789ebd4',
        'text': 'До якого рівня організації життя належить об’єкт, зображений на рисунку?',
        'cost': 3,
        'answers': {
          'A': {
            'text': 'молекулярного'
          },
          'B': {
            'text': 'клітинного',
            'correct': true
          },
          'C': {
            'text': 'організмового'
          },
          'D': {
            'text': 'екосистемного'
          }
        },
        'picture': 'http://localhost:4000/static/question-picture/63699ba235a9ef9e4d42f9d3c81fa20b.jpg'
      },
      'b0e22604-1b6b-4d48-81a6-b2c5954a7f4a': {
        'id': 'b0e22604-1b6b-4d48-81a6-b2c5954a7f4a',
        'text': 'У якій структурі рослинної клітини міститься клітинний сік?',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'хлоропласті'
          },
          'B': {
            'text': 'вакуолі',
            'correct': true
          },
          'C': {
            'text': 'рибосомі'
          },
          'D': {
            'text': 'ядрі'
          }
        }
      },
      'b4004386-d8cb-4449-8332-42ab6a774e36': {
        'id': 'b4004386-d8cb-4449-8332-42ab6a774e36',
        'text': 'Клітина кореня жита містить 14 хромосом. Скільки хромосом знаходиться в клітині ендосперму насінини?',
        'cost': 1,
        'answers': {
          'A': {
            'text': '7'
          },
          'B': {
            'text': '14'
          },
          'C': {
            'text': '21',
            'correct': true
          },
          'D': {
            'text': '28'
          }
        }
      },
      '1b19a1bc-d43d-49b1-a5c6-d2d33e17a8ed': {
        'id': '1b19a1bc-d43d-49b1-a5c6-d2d33e17a8ed',
        'text': 'Ботулізм — смертельна хвороба, яку спричиняють токсини бактерії Клостридіум. Який продукт може стати причиною ураження людини ботулізмом?',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'пліснявий хліб'
          },
          'B': {
            'text': 'гнилі фрукти'
          },
          'C': {
            'text': 'немиті овочі'
          },
          'D': {
            'text': 'домашні консерви',
            'correct': true
          }
        }
      },
      'a9d72410-06ec-4c37-9a12-c9ee0c0b3301': {
        'id': 'a9d72410-06ec-4c37-9a12-c9ee0c0b3301',
        'text': 'Збудник якої вірусної хвороби потрапляє в організм людини з продуктами харчування або водою?',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'гепатиту А',
            'correct': true
          },
          'B': {
            'text': 'СНІДу'
          },
          'C': {
            'text': 'поліомієліту'
          },
          'D': {
            'text': 'віспи'
          }
        }
      },
      'db48786b-1e42-4b51-80f2-42143cd142ea': {
        'id': 'db48786b-1e42-4b51-80f2-42143cd142ea',
        'text': 'Гриби подібні до тварин біологічною властивістю',
        'cost': 1,
        'answers': {
          'A': {
            'text': 'накопичувати крохмаль як запасну речовину.'
          },
          'B': {
            'text': 'накопичувати крохмаль як запасну речовину.'
          },
          'C': {
            'text': 'виділяти сечовину в процесі обміну речовин.',
            'correct': true
          },
          'D': {
            'text': 'здійснювати мейоз, статево розмножуватись.'
          }
        }
      }
    },
    'creationDate': '2021-05-07T14:46:56.464Z'
  }
}
